Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.StructGroupMemberWillDetachFromGrid
A structural element will be detached from grid(s) due to inconsistent group membership.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.JoiningDisjointWarn
Highlighted elements are joined but do not intersect.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.JoiningDisjoint
Highlighted elements are joined but do not intersect.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.FootingWillMoveToBottom
An attached Structural Foundation will be moved to the bottom of the Column.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.ElementWillBeDetachedFromPlane
Element will be detached from its associated plane

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepWallJoinToRoofError
Can't keep wall and [target] joined

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepWallJoinToRoof
Can't keep wall and [target] joined

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepTrussJoined
Can't keep the highlighted [Element]s joined.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepReferenceOfJoinedElementWarning
Can't keep reference of joined element.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepReferenceOfJoinedElement
Can't keep reference of joined element.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepJoined
Can't keep elements joined.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinRoofError
The roof cannot be joined.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinRoof
The roof cannot be joined.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsWarn
Can't keep elements joined.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsStructuralError
Can't keep elements joined.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsStructural
Can't keep elements joined.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsMultiPlaneError
Can't keep elements joined.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsError
Can't keep elements joined.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElements
Can't keep elements joined.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinDesignOptions
An element cannot join to an element in a secondary Design Option unless it is in the same secondary Design Option.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotCutJoinedGeometry
Element could not be cut by joined element.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotCope
Can't apply Coping.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures
Failures about JoinElements.